# Operations on DFs!

In [1]:
import pandas as pd

In [45]:
dataDict = {"Gender": ['F','M','M','F','F'],
           "Name": ['Charu',
                    'Munno',
                    'Chachu',
                    'Kokila',
                    'Mehuli',],
           "Age": [12,55,56,12,32]}

df = pd.DataFrame(data= dataDict)

In [4]:
df

  Gender    Name  Age
0      F   Charu   12
1      M   Munno   55
2      M  Chachu   56
3      F  Kokila   12
4      F  Mehuli   32

### .unique()

<br>
<br>
    
    Remember!
  
<br>
<br>
    
✖ Do Not Use.
<br> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <strike> df.unique() </strike>
    
                                                     Simply won't work on ENTIRE df.
✔ Use.
<br> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; df [ 'col' ].unique()

In [5]:
df['Age'].unique()

array([12, 55, 56, 32], dtype=int64)

### .nunique()

In [7]:
df['Age'].nunique()                           # Is equivelent to ---> len(df.['col'].unique())

4

### .value_counts()

In [10]:
df['Age'].value_counts()

12    2
55    1
32    1
56    1
Name: Age, dtype: int64

### df[ condition ]

In [12]:
display(df[ df['Age'] > 20])
display(df[ (df['Age'] > 20) & (df['Gender'] == 'M') ])

  Gender    Name  Age
1      M   Munno   55
2      M  Chachu   56
4      F  Mehuli   32

  Gender    Name  Age
1      M   Munno   55
2      M  Chachu   56

__
# apply()
'Coolest method ever seen!'

In [13]:
def doubleAge(age):
    return age*2

In [16]:
df['Age'].apply(doubleAge)                           # Broadcasts the function on each element

0     24
1    110
2    112
3     24
4     64
Name: Age, dtype: int64

In [17]:
df['Name'].apply(len)

0    5
1    5
2    6
3    6
4    6
Name: Name, dtype: int64

##### What if my function also takes other parameters?
# #Ask Gras

My answer: You can pass parameters with `args` parameter in apply AND pass them in a list i.e. **`args= [parameter1, parameter2]`**

####

### .sort_values()

In [36]:
df.sort_values('Age')                              # Cool, it uses the Quick Sort as method

  Gender    Name  Age
0      F   Charu   12
3      F  Kokila   12
4      F  Mehuli   32
1      M   Munno   55
2      M  Chachu   56

#### See, how index stays attatched with the row.
    To 'ignore' index use...
        >>>   df.sort_values('Age', ignore_index= True)
        
    
    And yes, your doubt.
    
    Why this function directly takes --- df.sort_values('Age') ?
                                         insted,
                                         df['Age'].sort_values() ?
    Answer:
    
    See,
       The second will work and for your wonder it will run without 
       any error! The error sould rise as we are not passing the col
       name in the arguement list.
       
       And if you give the col as an argument it will then give an error
       IN THIS CONDITION.
       
           >>>   df['Age'].sort_values('Age') ---> ERROR!
           
       The argument would have worked if there were another DF inside Age.
       
       AS PER MY UNDERSTANDING.
       Further research should be done.

### isnull()

In [46]:
df.isnull()

   Gender   Name    Age
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False

## Pivot Tables

In [2]:
data = {'A': ['Same','Same','Same','SHAME','SHAME','SHAME'],
        'B': ['one','one','two','two','one','one'],
        'C': ['x','y','x','y','x','y'],
        'D': [1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

       A    B  C  D
0   Same  one  x  1
1   Same  one  y  3
2   Same  two  x  2
3  SHAME  two  y  5
4  SHAME  one  x  4
5  SHAME  one  y  1

#### Yes, Pivot Tables in Pandas.
Before continuing, I want to discuss some theory from Excel which will help to understand it better.

    The pivot tables here are 'Kind-of-exact as in Excel.
    In Excel to create we have to follow these steps...
    
    1) Select the dataframe
    2) Then choose the fields to be put in 4 categories to
       build up a table.
       
           i.   Rows         - Column headers (fileds) as rows
           ii.  Columns      - Column headers (fileds) as columns
           iii. Vales        - Column headers (fields) to get data from [ must be numbers ]
           iv.  Filters      - Don't know but they also must be numbers.
           
    3) Create a table.
    
<br>
Here, in Pandas, the same thing is happening while creating a pivot table.
<br>
We have to pass the THREE arguments... let's compare...

     EXCEL          PANDAS
    -------        --------
    
    Rows           index
    Columns        columns
    Values         values
    
    Filters        [don't know actually...(not required)]
    
### Enough theory, let's see them in action!

In [4]:
df

       A    B  C  D
0   Same  one  x  1
1   Same  one  y  3
2   Same  two  x  2
3  SHAME  two  y  5
4  SHAME  one  x  4
5  SHAME  one  y  1

In [8]:
df.pivot_table(index= ['A','B'],
               columns= ['C'],
               values= 'D')

C            x    y
A     B
SHAME one  4.0  1.0
      two  NaN  5.0
Same  one  1.0  3.0
      two  2.0  NaN

### SOME UNDISCUSSED FUNCTIONS

    DF.head()
    DF.tail()
    DF.info()
    DF.idxmax()   using it instead of DF[DF['...'] == ''], but will return only FIRST max occurance
    DF.idxmin()
                    __
                    
                    USE idxmax / idxmin with loc[] or iloc[] !
                    __
    
    DF.value_counts()  --> Will return the COUNTS of same values! Freaking shit! ( Using instead of Groupby and 
                           then Count)
                    __
                           
                    AUTOMATICALLY SORTED!
                    __
                 
#### Note:

When you apply sum() on the series, it will COUNT the True values repetation. Instead of giving an error like HOW CAN I SUM BOOLEAN VALUES!

###  Easy!
That's it for this notebook.
<br>
Next up, <b> Data Input Output <b>

###

###

Now some wild stuff...

In [18]:
data = {'A': ['Same','Same','Same','SHAME','SHAME','SHAME'],
        'B': ['one','one','two','two','one','one'],
        'C': ['x','y','x','y','x','y'],
        'D': [1,3,2,5,4,1]}

df = pd.DataFrame(data)
display(df)
display(df.pivot_table('D',['A','B'],'C'))

       A    B  C  D
0   Same  one  x  1
1   Same  one  y  3
2   Same  two  x  2
3  SHAME  two  y  5
4  SHAME  one  x  4
5  SHAME  one  y  1

C            x    y
A     B
SHAME one  4.0  1.0
      two  NaN  5.0
Same  one  1.0  3.0
      two  2.0  NaN

###

###

###

###

In [14]:
import pandas as pd
import numpy as np
from IPython.display import display, HTML

CSS = """
.output {
    flex-direction: row;
}
"""

HTML('<style>{}</style>'.format(CSS))